# Stock Market CBOE VIX Analysis and Prediction using LSTM

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Reading the dataset

In [4]:
data= pd.read_csv('flat-ui__data.csv')
data.head()

         DATE   OPEN   HIGH    LOW  CLOSE
0  03/22/2024  12.92  13.15  12.58  13.06
1  03/21/2024  12.98  13.08  12.40  12.92
2  03/20/2024  13.83  14.17  13.01  13.04
3  03/19/2024  14.50  14.86  13.80  13.82
4  03/18/2024  14.75  14.85  14.26  14.33

In [12]:
data.dtypes

DATE      object
OPEN     float64
HIGH     float64
LOW      float64
CLOSE    float64
dtype: object

In [17]:
data['DATE'] = pd.to_datetime(data['DATE'])

In [18]:
data.dtypes

DATE     datetime64[ns]
OPEN            float64
HIGH            float64
LOW             float64
CLOSE           float64
dtype: object

In [8]:
data.describe()

              OPEN         HIGH          LOW        CLOSE
count  8632.000000  8632.000000  8632.000000  8632.000000
mean     19.629685    20.435451    18.880280    19.543306
std       7.967062     8.427376     7.458714     7.894811
min       9.010000     9.310000     8.560000     9.140000
25%      13.920000    14.500000    13.390000    13.840000
50%      17.740000    18.410000    17.145000    17.700000
75%      23.062500    23.922500    22.272500    22.942500
max      82.690000    89.530000    72.760000    82.690000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8632 entries, 0 to 8631
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DATE    8632 non-null   object
 1   OPEN    8632 non-null   float64
 2   HIGH    8632 non-null   float64
 3   LOW     8632 non-null   float64
 4   CLOSE   8632 non-null   float64
dtypes: float64(4), object(1)
memory usage: 337.3+ KB

In [10]:
data.isnull().sum()

DATE     0
OPEN     0
HIGH     0
LOW      0
CLOSE    0
dtype: int64